// "© Copyright 2004-2017 HP Development Company, L.P."

OfflineMessageText = "Unable to communicate with the selected device.\nIt may have been turned off, or otherwise disconnected.";
TextTooLongErrorExplanation = "Please enter text with length that is less than or equal to %d characters.";
NumberNotInRangeErrorExplanation = "Please enter number value that is less than %f or greater than %f.";
IncorrectIpAddressErrorExplanation = "The IP address must consist of four sets of numbers (0 through 255 each), separated by periods.";
InvalidCharsInTextErrorExplanation = "Please enter valid characters.";

TwowayConnectionErrorTitle = "Cannot establish two-way communication with the device";
TwowayConnectionErrorMessage = "Please check that your device is connected and turned on, then try again.";

DeviceInReserveModeMsg = "Cannot perform alignment in reserve mode. Please replace empty or missing ink cartridges.";
DeviceInReserveModeMsgPigment = "Cannot perform alignment in reserve mode. Please replace empty or missing cartridges.";

NoPensErrorTitle = "No print cartridges have been detected";
NoPensErrorMessage = "If print cartridges have been installed, verify the plastic tape covering the ink nozzles has been removed.";
NoPensErrorMessagePigment = "If print cartridges have been installed, verify the plastic tape covering the cartridge nozzles has been removed.";

OnlyPhotoPenInstalledErrorTitle = "Cannot perform alignment when only photo pen installed";
OnlyPhotoPenInstalledErrorMessage = "Alignment can be done with color only, black only, color/black, color/photo cartridges installed. Please install one of the allowed pen combinations.";

NoCartridgesErrorTitle = "No print cartridges have been detected";
NoCartridgesErrorMessage = "Printing cannot occur without all print cartridges installed. Refer to the device documentation for more information.";

SomeCartridgeErrorTitle = "Printing cannot occur without all cartridges installed";
SomeCartridgeErrorMessage = "A cartridge appears to be missing, not detected, or incorrectly installed.";

SomePenErrorTitle = "Printing cannot occur without all cartridges installed";
SomePenErrorMessage = "An ink cartridge appears to be missing, not detected, or incorrectly installed.";
SomePenErrorMessagePigment = "A cartridge appears to be missing, not detected, or incorrectly installed.";

SomePrintheadErrorTitle = "Printing cannot occur without all printheads installed";
SomePrintheadErrorMessage = "Printhead appears to be missing, not detected, or incorrectly installed.";

PrintheadErrorTitle = "Printing cannot occur without printhead installed";

NoAlignTitle = "Cannot perform Align";
NoAlignMsg = "Please check that your device is connected and turned on, then try again.";

CalibrationFailedTitle = "Cannot perform the print quality calibration";

FrontDoorOpenTitle = "Front Door Open";
DoorOpenTitle = "Door/Cover is open";
DoorOpenMsg = "The device cannot print because a cover is open. Please close all covers on the device.";

DeviceBusyErrorTitle = "Device is currently busy";
DeviceBusyErrorMessage = "Please wait while the device finishes its current job.";

IncorrectStateErrorTitle = "Printer is in an error state";
IncorrectStateErrorMessage = "Please resolve the error condition for the device and try again.";

InstallFuserErrorTitle = "Fuser is missing";
InstallFuserErrorMessage = "Turn the device off, reinstall fuser, then turn the device back on.";

UnsupCartridgeTitle = "Unsupported print cartridge";
UnsupSilverPenMsg = "The installed Silver print cartridge is not supported for Macintosh printing.\nPlease replace the print cartridge with a Black print cartridge and try again.";

NotInitiatedTitle = "Cleaning could not be initiated";
NotInitiatedMsg = "The cleaning procedure could not be initiated. Please check that the device is online and is not processing any jobs.";

NoCmyCartridgeTitle = "Cannot perform the print quality calibration";
NoCmyCartridgeMsg = "To perform this procedure please insert a Tri-Color cartridge in your device.";

Yes = "Yes";
No = "No";

HSDCancelButtonTitle = "Cancel";
HideButtonTitle = "Hide";
HSDOKButtonTitle = "OK";
HSDContinueButtonTitle = "Continue";
HSDDoneButtonTitle = "Done";
HSDCloseButtonTitle = "Close";
HSDSkipButtonTitle = "Skip";
HSDMoreInfoButtonTitle = "More Info…";
HSDQuitButtonTitle = "Quit";
HSDRetryButtonTitle = "Retry";

CDopenTitle = "CD/DVD tray is open";
CDopenMsg = "Please close the CD/DVD tray to continue printing from the Main tray.";

DidFailLoadTitle = "Can't open the page";
DidFailLoadMessageFormat = "URL: %@\nReason: %@";
LoadingErrorString = "Resource is unavailable.";
WebLoadingString = "Loading...";

DownloadInfoFormatString = "%@ of %@";
BytesFormatString = "%d bytes";
KilobytesFormatString = "%.1f KB";
MegabytesFormatString = "%.1f MB";
GigabytesFormatString = "%.2f GB";

USB = "USB";
Network = "Network";
Bluetooth = "Bluetooth";
Bonjour = "Bonjour";
IP = "IP";
AppleTalk = "Apple Talk";
HPWirelessConnect = "HP Wireless Connect";
UNKNOWN = "Unknown";

ProfileErrorTitle = "Could not register profile";
ProfileOperationErrorMessage = "ColorSync registration failed with error code: %i.";
ProfileNotFoundMessage = "ColorSync entry for your device contains errors. Please re-create the print queue to fix this issue.";

StatusLineSeparator = "%, ";
ClearStatusLineSeparator = ", ";
ConnectingMessage = "Connecting to device\n%@";
AbstractConnectingMessage = "Connecting...";
RetrieveInformationProcessTitle = "Retrieving information…";
ApplySettingsProgressTitle = "Applying settings…";

CouldNotRetrieveSettings = "Could not retrieve settings";
CouldNotRetrieveSettingsDescription = "An unknown error has occurred when communicating with the device. Please try again later.";

//paper management keys
ResponseErrorMessage = "Please check that your device is connected, turned on and not printing.";
OfflineTitle = "Device is Offline";
OfflineMsg = "Device is offline and cannot process print jobs.";
DownloadProfilesTitleString = "Downloading ICC profiles...";
SynchronizeProfilesTitleString = "Updating ICC profiles...";

//PrintingPropertiesWindow
"TaskNameTitle" = "Printing Properties";
"PaperThicknessTitle" = "Paper Thickness:";
"NormalThicknessTitle" = "Normal";
"ThickThicknessTitle" = "Thick";
"DryTimeTitle" = "Dry Time:";
"ManualDryTimeSecondsTitle" = "seconds";
"NoneDryTimeTitle" = "None";
"ReducedDryTimeTitle" = "Reduced";
"AutomaticDryTimeTitle" = "Automatic";
"ExtendedDryTimeTitle" = "Extended";
"ManualDryTimeTitle" = "Manual";
"StarwheelsTitle" = "Starwheels:";
"UpStarwheelsTitle" = "Up";
"DownStarwheelsTitle" = "Down";
"VacuumLevelTitle" = "Vacuum Level:";
"HighestVacuumLevelTitle" = "Highest";
"HighVacuumLevelTitle" = "High";
"NormalVacuumLevelTitle" = "Normal";
"LowVacuumLevelTitle" = "Low";
"LowestVacuumLevelTitle" = "Lowest";
"AdvanceAdjustmentTitle" = "Paper Advance Calibration:";
"AdvanceAdjustmentUnitsTitle" = "‰ (ppt)";
"AdvanceAdjustmentInfoTitle" = "(1‰ is 1 mm per meter or 1 mil per inch)";
"InkLimitsTitle" = "Global Ink Limits:";
"GlossEnhancerTitle" = "Gloss Enhancer Amount:";
"CutterTitle" = "Cutter";
"RestorePrintingPropTitle" = "Restore Printing Properties";
"HelpButtonTooltip" = "Help";
HSDGoBackButtonTitle = "Go Back";

// status

StapleCartridgeTitle = "Staples Cartridge %d";
BlackDrumTitle = "Black Drum";
CyanDrumTitle = "Cyan Drum";
YellowDrumTitle = "Yellow Drum";
MagentaDrumTitle = "Magenta Drum";
UndefinedDrumTitle = "Imaging Drum";
BlackCartridgeTitle = "Black Cartridge";
CyanCartridgeTitle = "Cyan Cartridge";
MagentaCartridgeTitle = "Magenta Cartridge";
YellowCartridgeTitle = "Yellow Cartridge";
ImageTransferKit = "Transfer Kit";
ImageFuserKit = "Fuser Kit";
MaintenanceKit = "Maintenance Kit";
RollerKit = "Roller Kit";
TonerCollectionUnit = "Toner Collection Unit";
DocumentFeederKit = "Document Feeder Kit";
InkCollectionUnit = "Ink Collection Unit";
PageWideCollectionUnit = "Collection Unit";

BlackInkCartridgeTitle = "Black ink";
MatteBlackInkCartridgeTitle = "Matte Black ink";
PhotoBlackInkCartridgeTitle = "Photo Black ink";
CyanInkCartridgeTitle = "Cyan ink";
MagentaInkCartridgeTitle = "Magenta ink";
YellowInkCartridgeTitle = "Yellow ink";
LightCyanInkCartridgeTitle = "Light Cyan ink";
LightMagentaInkCartridgeTitle = "Light Magenta ink";
LightGrayInkCartridgeTitle = "Light Gray ink";
GrayInkCartridgeTitle = "Gray ink";
CMYInkCartridgeTitle = "Tri-color ink";
KCMInkCartridgeTitle = "Photo ink";
BCMInkCartridgeTitle = "Blue Photo ink";
GGKInkCartridgeTitle = "Gray Photo ink";
SilverInkCartridgeTitle = "Silver";
GoldInkCartridgeTitle = "Gold";
BronzeInkCartridgeTitle = "Bronze";
MetallicInkCartridgeTitle = "Metallic";
LeftInkCartridgeTitle = "Left";
RightInkCartridgeTitle = "Right";

BlackPageWideCartridgeTitle = "Black Cartridge";
CyanPageWideCartridgeTitle = "Cyan Cartridge";
MagentaPageWideCartridgeTitle = "Magenta Cartridge";
YellowPageWideCartridgeTitle = "Yellow Cartridge";

BlackPrintheadName = "Black printhead";
CyanPrintheadName = "Cyan printhead";
MagentaPrintheadName = "Magenta printhead";
YellowPrintheadName = "Yellow printhead";
LightCyanPrintheadName = "Light Cyan printhead";
LightMagentaPrintheadName = "Light Magenta printhead";
CMYPrintheadName = "CMY printhead";
KCMPrintheadName = "KCM printhead";
GGKPrintheadName = "gGK printhead";
BlackYellowPrintheadName = "Black / Yellow printhead";
CyanMagentaPrintheadName = "Cyan / Magenta printhead";
MagentaYellowPrintheadName = "Magenta / Yellow printhead";
MatteBlackCyanPrintheadName = "Matte Black / Cyan printhead";
LightMagentaLightCyanPrintheadName = "Light Magenta / Light Cyan printhead";
PhotoBlackLightGrayPrintheadName = "Photo Black / Light Gray printhead";
CMYKPrintheadName = "CMYK printhead";
BBBKPrintheadName = "BBBK printhead";
MagentaCyanPrintheadName = "Magenta / Cyan printhead";
MatteBlackYellowPrintheadName = "Matte Black / Yellow printhead";
GrayPhotoBlackPrintheadName = "Gray / Photo Black printhead";

TrayNameTemlate = "Tray %d";
"ENV FEEDER" = "Envelope Feeder";
"Envelope Feeder" = "Envelope Feeder";
"Multipurpose Tray" = "Multipurpose Tray";

MediaStatusUnknown = "Unknown";
MediaStatusNotEmpty = "Not Empty";
MediaStatusEmpty = "Empty";
MediaStatusLow = "Low";
MediaStatusFull = "Full";
MediaStatusOk = "OK";

BlackPrintheadColor = "Black";
CyanPrintheadColor = "Cyan";
MagentaPrintheadColor = "Magenta";
YellowPrintheadColor = "Yellow";
LightCyanPrintheadColor = "Light Cyan";
LightMagentaPrintheadColor = "Light Magenta";
CMYPrintheadColor = "CMY";
KCMPrintheadColor = "KCM";
GGKPrintheadColor = "gGK";
BlackYellowPrintheadColor = "Black / Yellow";
CyanMagentaPrintheadColor = "Cyan / Magenta";
MagentaYellowPrintheadColor = "Magenta / Yellow";
MatteBlackCyanPrintheadColor = "Matte Black / Cyan";
LightMagentaLightCyanPrintheadColor = "Light Magenta / Light Cyan";
PhotoBlackLightGrayPrintheadColor = "Photo Black / Light Gray";
CMYKPrintheadColor = "CMYK";

// online privacy UI
HSDOnlineWarningSheetTitle = "Accessing Online Information";
HSDOnlineWarningSheetBasicMessage = "If you click \"Continue\" your default web browser will be used to go online and access HP web pages.";

HSDOnlineWarningSheetExtendedMessage = "If you click \"Continue\" your default web browser will be used to go online and access HP web pages. To complete this operation, some information will be sent to HP web servers.";
HSDOnlineWarningSheetExtendedComment = "HP may use this information to create personalized experiences, present relevant offers and improve your experience with HP.";

HSDOnlineWarningSheetCheckboxTitle = "Do not show this warning again";
HSDPrivacyPolicyOnlineLinkTitle = "HP Privacy Statement";
HSDPrivacyPolicyOnlineLinkValue = "http://welcome.hp.com/country/us/en/privacy.html";

HSDPrivacyStatementOnlineLink = "HP Privacy Statement";
HSDViewPrivacyStatementOnlineLink = "HP Privacy Statement";
HSDViewSharedDataLink = "View data shared with HP";

DetailsTitle = "Details";

InfoToSendFieldFormat = "%@: %@\n";
MacOSVersion = "Mac OS version";
DeviceSerialNumber = "Device serial number";
DeviceModelNumber = "Device model number";
DeviceProductNumber = "Device product number";
DeviceModelName = "Device model name";
ServiceID = "Service ID";
ModelID = "Model ID";
DeviceSKUName = "Device SKU Name";
HSDLifesaverClaimIDTitle = "Activation Code";
HSDDeviceUUIDTitle = "Device UUID";
HSDZipCodeTitle = "Zip Code";

// authentication dialog
AuthenticationTitle = "Type your password to access these settings.";
AuthenticationDescription = "The settings you are trying to access require password that was previously set on your device.";
ShowPasswordTitle = "Show password";
KeyChainTitle = "Remember this password in my keychain";
IncorrectPasswordMessage = "The password is incorrect.";

// ICC profile registration
DriverNeedsUpdateMsg = "Your driver requires update. Please click HP Support to go to HP website and check for new drivers.";
DeviceIsBusyMsg = "Device is busy. Please try again when device is not printing.";
HPSupportButtonTitle = "HP Support";

// Applying device settings
ApplyDeviceSettingsGenericError = "Could not apply settings";
ApplyDeviceSettingsGenericErrorRecoverySuggestion = "Check if the device is online and connected.";

// assistant
AssistantCloseAlertTitle = "Are you sure you want to close the assistant?";
AssistantCloseAlertMessage = "The assistant configures your HP device or software so that you can take advantage of all its features and capabilities. Some features may not work if the device is not configured properly.";
AssistantTocViewWidth = "180";
AssistantTaskViewPreferredSize = "{630,385}";

DeviceIsAlreadySetUpTitle = "Device is set up";
DeviceIsAlreadySetUpMessage = "The selected device has already been set up.";

DeviceDoesNotRequireSetupTitle = "No setup required";
DeviceDoesNotRequireSetupMessage = "The selected device does not need setting up.";

CannotConfigureWirelessTitle = "Cannot setup wireless";
CannotConfigureWirelessMessage = "Wi-Fi will not work with the Ethernet cable attached.";

HSDUseHPEasyStartToSetupDeviceTitle = "HP Easy Start is required to set up this device";
HSDUseHPEasyStartToSetupDeviceMessage = "HSD_TEXT:HP Easy Start is the new way to set up your HP printer and prepare your Mac for printing. HSDHPEasyStartDescription";

HSDUseHPEasyStartToSetupDeviceString = "HSD_TEXT:HP Easy Start is required to set up the device at this address. HSDHPEasyStartDescription";

HSDHPEasyStartDescription = "HSD_TEXT:HP Easy Start will locate and install the latest software for your printer and then guide you through printer setup.

Get HP Easy Start at HSD_LINK:HSDEasyStartLink.";

DeviceIsNotSupportedTitle = "The device is not supported";
DeviceIsNotSupportedMessage = "Updating HP Utility or using other HP software that is designed to support this device may solve the problem.";
DeviceAtAddressIsNotSupportedString = "The device at this address is not supported. Updating HP Utility or using other HP software that is designed to support this device may solve the problem.";
MultipleDriversNotInstalledTitle = "The HP software that is required to set up your device was not found";
MultipleDriversNotInstalledWarningTitle = "Some HP software that is required to set up your device was not found";
PrintDriverNotInstalledTitle = "The HP software that is required to set up printing was not found";
ScanDriverNotInstalledTitle = "The HP software that is required to set up scanning was not found";
FaxDriverNotInstalledTitle = "The HP software that is required to set up faxing was not found";
HSDInstallLatestSoftwareMessage = "HSD_TEXT:Download and install the latest software for your device from HSD_LINK:HSD_URL:HSDSupportLink_URL, and then try again.";
HSDMissingSoftwareMessage = "HSD_TEXT:Download and install the latest software for your device from HSD_LINK:HSD_URL:HSDSupportLink_URL, and then try again. If you choose to continue without installing the latest software, some features will not work.";

DisabledFeaturesWarningSheetTitle = "Disabled Features";
DisabledFeaturesWarningSheetMessage = "An administrator has disabled some features of the selected device.\n\nFor more information, check with an administrator or consult the device documentation.";

DeviceIsConnectedViaAccessPointTitle = "Device cannot be set up through a special wireless network";
DeviceIsProbablyConnectedViaAccessPointMessage = "The connection to the selected device has probably been established through a special wireless network created by the device. If the device appears in the list twice, select the entry that is not currently selected. Otherwise, make sure the device is connected to a wired or wireless network to which your computer has access, and then try again.\n\nIf your computer is not connected to the device's special wireless network, click Continue to set up the device.";
DeviceIsConnectedViaAccessPointMessage = "The connection to the selected device has been established through a special wireless network created by the device. If the device appears in the list twice, select the entry that is not currently selected. Otherwise, make sure the device is connected to a wired or wireless network to which your computer has access, and then try again.";

// HP Privacy Statement Panel
HSDHPPrivacyStatementTitle = "HP Privacy Statement";
HPPrivacyStatement = "HP is committed to protecting the privacy of our customers. Registration data may be used in anonymous and aggregate form for purposes of market research which will allow HP to improve the quality of its products and service offerings. Collected data may be retained for a period of up to five years from the date of the last data transfer to HP and will be sent to an HP entity that may be located overseas.\n\nHP sends your information electronically to HP servers. The IP address of the sending computer will be used for transmission purposes only.";
HPOnlinePrivacyStatementButtonTitle = "HP Privacy Statement";

// Assistant window titles
HSDAssistantWindowTitleFormat = "HP Utility - %@";
HSDAssistantSetupWindowTitle = "Setup";
HSDDesignjetAssistantWindowTitle = "HP Designjet Assistant";

//Add Device Manually titles
ManualAddWindowTitle = "Add Device Manually";
ManualAddTitle = "Add Device Manually";
ManualAddAddressTypeLabel = "Address Type:";
ManualAddAddressLabel = "Address:";
ManualAddFormatTitle = "Format:";
CancelButton = "Cancel";
AddButton = "Add";

InvalidAddress = "Invalid address";
ProgressMessage = "Connecting to device…";
NotReachableMessage = "Device is not reachable";
NotSupportedDeviceMessage = "Device at this address is not supported";

HostHameFormat = "name.domain";
HostOrBonjourDomainName = "Host or Bonjour Domain Name";

ConnectToNetworkWithoutBluetooth = "Please connect your computer to a wired or wireless network, and try again.";
ConnectToNetwork = "Please connect your computer to a wired or wireless network, or enable Bluetooth, and try again.";
NoNetworkConnection = "No network connection";

BluetoothIsOffAlertMessage = "Bluetooth is turned off on your Mac";
BluetoothIsOffAlertExplanation = "Please enable Bluetooth via System Preferences or Bluetooth menu";

HPTableHeaderColumnName = "column";
MoreInfoTitle = "More Information";

// Device Unavailable strings
kDeviceUnavailabilityAlertTitleKey = "Connection to the device was lost";
kDeviceReconnectUnavailabilityAlertTitleKey = "Connection with device can not be established.";
kDeviceUnavailabilityAlertReconnectButtonTitleKey = "Reconnect";
kDeviceUnavailabilityAlertSelectOtherButtonTitleKey = "Select Other...";
kDeviceUnavailabilityAlertMessageKey = "You can choose other device or try to reconnect with the current device.";

HSDCurrentSettingTitle = "[Current Setting]";

// Printer sleeping warning
PrinterIsSleepingTitle = "This functionality is not available while the printer is in sleep mode.";
PrinterIsSleepingMessage = "If you want to wake up your printer now, click the 'Wake Up' button below";
WakeUpButtonTitle = "Wake Up";

HSDUserNameTitle = "Username:";
HSDPasswordTitle = "Password:";

HSDPromptToLogin = "To view this page you must login.";
HSDPromptToLoginIncorrectPassword = "The user name or password you entered was incorrect. Make sure you’re entering them correctly, and then try again.";
HSDPromptToLoginInformativeText = "Your password will be sent unencrypted.";
